{"title": "conditional-test-article", "category": 4, "raw": "MAAS lets you manage bare-metal servers, thousands of miles away, without even being there.  You can boot them, reload the OS, install and change apps, and completely reconfigure your network, all from the comfort of your recliner, if you so choose.  No traveling; no sending in admins; and no army of sessions to manage your cloud.\n\nYou only need two things to start with: network connections to your servers, and network boot settings for all.  MAAS takes care of the rest. Easy, huh?\n\n#### Quick questions you might have:\n\n* [What is MAAS?](#heading--what-is-maas)\n* [What does MAAS offer me?](/t/about-maas/840#heading--what-maas-offers)\n* [Can MAAS colocate key components to conserve my resources?](/t/about-maas/840#heading--colocation-of-key-components)\n* [How does MAAS work?](/t/about-maas/840#heading--how-maas-works)\n\n<h2 id=\"heading--what-is-maas\">What is MAAS?</h2>\n\nMAAS expands to \"Metal As A Service\". It basically turns bare-metal servers into virtual machines living in the cloud. No need to manage individual units: provision or destroy machines quickly, to your heart's content.\n\nMAAS can act as a standalone PXE/preseed service or integrate with other technologies. It works exceptionally well with [Juju](https://jaas.ai/docs/maas-cloud), the service and model management tool. MAAS manages the machines and Juju manages the services running on those machines -- a perfect arrangement.  Virtual machines (VMs) can even act as MAAS machines if they boot from the network via PXE.\n \n![deploying|690x385](upload://tUorx2JPUx7lJyuYK9fzvpbAekv.jpeg)  \n\n<!-- vanilla\nFor example, when you're trying to configure your hospital data centre, you could commission a number of machines and allocate them to different functions, like medrec and physdoc.  Then you can use Juju to model the overall flow of patient information through the system, assigning services as desired.\n vanilla -->\n<!-- hospital\nFor example, when you're trying to configure your hospital data centre, you could commission a number of machines and allocate them to different functions, like medrec and physdoc.  Then you can use Juju to model the overall flow of patient information through the system, assigning services as desired.\n hospital -->\n<!-- telco\nFor example, when you're trying to configure your CO data centre, you could commission a number of machines and allocate them to different functions, like trunking and ticketing.  Then you can use Juju to model the overall flow of patient information through the system, assigning services as desired.\n telco -->\n<details><summary>Tell me about PXE booting</summary>\n\nPXE stands for \"Preboot Execution Environment,\" usually pronounced \"pixie.\"  The term refers to a way of booting an OS image (or other software assembly) downloaded to a client via a NIC.  The NIC must be PXE-capable for this to work.  Many NICs can be configured to support PXE boot with a software switch.\n\n</details>\n\n<h2 id=\"heading--what-maas-offers\">What MAAS offers</h2>\n\nMAAS can manage a large number of physical machines by merging them into user-defined resource pools. MAAS automatically provisions participating machines and makes them available for use. You can return unused machines to the assigned pool at any time. \n\nMAAS integrates all the tools you need into a smooth system-management experience. It includes:\n\n- web UI (optimised for mobile devices)\n- Ubuntu, CentOS, Windows, and RHEL installation support\n- open-source IP address management (IPAM)\n- full API/CLI support\n- high availability (optional)\n- IPv6 support\n- inventory of components\n- DHCP and DNS for other devices on the network\n- DHCP relay integration\n- VLAN and fabric support\n- NTP for the entire infrastructure\n- hardware testing\n- composable hardware support\n\nThese tools can be controlled from a responsive [web UI](/t/web-ui/782) or a [CLI](/t/maas-cli/802) driven by a REST API.  You can easily (re)configure and scale your data centre with MAAS.\n\n![mixed-states|690x438](upload://5cwZFoAljFf5nKDD0bDf5OJ55t.jpeg)  \n\nMAAS works with any system configuration tools. Both the [Chef](https://www.chef.io/chef) and [Juju](https://jaas.ai/) teams recommend MAAS as a physical provisioning system.\n\n[note]\nPlease note that Windows and RHEL images require [Ubuntu Advantage](https://www.ubuntu.com/support) to work correctly with MAAS.\n[/note]\n\n<h3 id=\"heading--colocation-of-key-components\">Colocation of key components</h3>\n\nMAAS relies on two key components: the *region controller* and the *rack controller*. The region controller handles operator requests; the rack controller provides high-bandwidth services to multiple racks. In essence, rack controllers manage racks, while the region controller manages the data centre.  See [Concepts and terms](/t/concepts-and-terms/785#heading--controllers) for a deeper understanding of these components.\n\nWe generally recommended installing both controllers on the same system.  The default MAAS install delivers this colocated configuration automatically. This all-in-one solution also provides [DHCP](/t/dhcp/759). \n\nIn special cases, such as [high availability or load balancing](/t/high-availability/804), you will want to install multiple region and rack controllers.  You should also review your existing network design to determine whether [MAAS-managed DHCP](/t/dhcp/759) will cause problems.\n\n![intro-arch-overview](https://discourse.maas.io/uploads/default/original/1X/5fc8edb2243aa4d4ac6ba7981a7b917fec27c480.png)\n\n<h2 id=\"heading--how-maas-works\">How MAAS works</h2>\n\nWhen you [add a new machine](/t/add-machines/821#heading--add-a-node-manually) to MAAS, or elect to add a machine that MAAS has [enlisted](/t/add-machines/821#heading--enlistment), MAAS [commissions](/t/commission-machines/822) it for service and adds it to the pool.  At that point, the machine is ready for use. MAAS keeps things simple, marking machines as \"New,\" \"Commissioning,\" \"Ready,\" and so on.\n\n<details><summary>Tell me, quickly, about enlistment and commissioning.</summary>\n\nThere are two ways to add a machine to MAAS.  Assuming it's on the network and capable of PXE-booting, you can add it explicitly -- or MAAS can simply discover it when you turn it on.\n\nEnlistment just means that MAAS discovers a machine when you turn it on, and presents it to the MAAS administrator, so that they can choose whether or not to commission it.  Machines that have only been enlisted will show up in the machine list as \"New.\"\n\nCommissioning means that MAAS has successfully booted the machine, scanned and recorded its resources, and prepared it for eventual deployment.  Machines that you explicitly add are automatically commissioned.  MAAS marks a successfully-commissioned machine as \"Ready\" in the machine list.\n\n</details>\n\n![commissioning|606x400](upload://dK1s4OaSl7oPzXDpE9Cgcxrqi40.jpeg) \n\nMAAS controls machines through IPMI (or another BMC). It can also manage machines through a converged chassis controller, such as Cisco UCS.  You can choose how you want to control power on your machines based on what is available.  MAAS overwrites the machine's disk space with your chosen, pre-cached OS images.\n\n[note type=\"negative\" status=\"Warning\"]\n*The above comment about disk space bears repeating: MAAS will overwrite the disk space of all machines it enlists. All pool machines are under the control of MAAS; you should provision them using other methods.*\n[/note]\n\nMAAS users allocate (\"acquire\") machines for use when needed. The web UI also allows you to acquire machines manually, such as when you are reserving specific hardware for certain users. You can remotely access and customise the installed operating system via SSH.\n\n![acquire|690x363](upload://ipfwOGPPFapA83rrvdJe12zgaZd.jpeg) \n\nWhen acquiring machines from the API/CLI, you can specify requirements (\"constraints\"). Common constraints are memory, CPU cores, connected networks, and assigned physical zone.\n\nAn acquired MAAS machine is more flexible than a virtual instance in a cloud. You have complete control, including hardware drivers and root access. If you want to upgrade the BIOS, for example, you can allocate a machine to yourself and complete the upgrade.  Once you have completed the upgrade, you can send the machine back to the pool.\n\nNote that [Juju](https://jaas.ai/docs/maas-cloud) is designed to work with MAAS. MAAS becomes a backend Juju resource pool with all functionality fully available. For instance, if Juju removes a machine, then MAAS will release that machine to the pool.  With Juju, MAAS can become an integral part of your data centre strategy and operations.\n<!-- zork-out -->\n                                                                                                                                                                                                                                                                                                                                                                                             "}